<template>
	<ul class="m-ul">
        <li class="m-li" v-for="item in boxData">
            <div>
                <middlebox v-bind:boxData = "item"></middlebox>
            </div>
        </li>
        
	</ul>
</template>

<script>
	import middlebox from './middlebox.vue';

	export default {
		data() {
			return {
				boxData:[
					{
			       		title:'卷烟销量',
			       		rightUpIcon:'fa-bar-chart',
			       		content:'145.10',
			       		subContent:'万箱',
			       		subTitleLeft:'去年同期',
			       		subContentLeft:'153.94万箱',
			       		subTitleRight:'增减幅度',
			       		subContentFlag:'1',//0:表示增加,1:表示减少
			       		subContentRight:'5.74%',
			       		monthChartData:[
			       			['201607','201608','201609','201610','201611','201612','201701','201702','201703','201704','201705','201706'],
			       			['10.90','13.59','13.09','11.04','12.10','11.98','19.96','6.14','11.34','10.36','10.36','11.26'],
			       			['10.37','13.07','13.64','11.48','13.69','13.51','17.36','8.57','11.13','10.01','11.13','10.81'],
			       			['-4.89','-3.85','4.17','3.98','13.14','12.78','-13.04','39.53','-1.89','-3.39','7.39','-4.00'],
			       			[0,25,5]
			       		]
			       	},
			       	{
			       		title:'销售收入',
			       		rightUpIcon:'fa-bar-chart',
			       		content:'384.68',
			       		subContent:'亿元',
			       		subTitleLeft:'去年同期',
			       		subContentLeft:'415.24亿元',
			       		subTitleRight:'增减幅度',
			       		subContentFlag:'1',//0:表示增加,1:表示减少
			       		subContentRight:'7.36%',
			       		monthChartData:[
			       			['201607','201608','201609','201610','201611','201612','201701','201702','201703','201704','201705','201706'],
			       			['2.84','3.84','3.20','2.79','3.00','3.10','5.28','1.75','2.98','2.89','2.87','2.99'],
			       			['2.64','3.40','3.71','3.00','3.53','3.47','5.41','2.35','2.99','2.83','3.14','2.98'],
			       			['-7.23','-11.46','15.84','7.58','17.36','11.90','2.46','34.06','0.19','-2.05','9.32','-0.51'],
			       			[0,7,1]
			       		]
			       	},
			       	{
			       		title:'单箱均价',
			       		rightUpIcon:'fa-bar-chart',
			       		content:'2.65',
			       		subContent:'万元',
			       		subTitleLeft:'去年同期',
			       		subContentLeft:'2.70万元',
			       		subTitleRight:'增减幅度',
			       		subContentFlag:'1',//0:表示增加,1:表示减少
			       		subContentRight:'1.71%',
			       		monthChartData:[
			       			['201607','201608','201609','201610','201611','201612','201701','201702','201703','201704','201705','201706'],
			       			['2.59','2.65','2.74','2.61','2.69','2.55','2.65','2.85','2.63','2.79','2.77','2.66'],
			       			['2.54','2.60','2.72','2.61','2.58','2.57','3.12','2.74','2.69','2.83','2.82','2.76'],
			       			['-2.00','-1.95','-0.90','0.10','-4.15','0.76','17.82','-3.92','2.11','1.39','1.80','3.63'],
			       			[0,4,0.5]
			       		]
			       	},
			       	{
			       		title:'重点品牌销量',
			       		rightUpIcon:'fa-bar-chart',
			       		content:'107.09',
			       		subContent:'万箱',
			       		subTitleLeft:'去年同期',
			       		subContentLeft:'117.21万箱',
			       		subTitleRight:'增减幅度',
			       		subContentFlag:'1',//0:表示增加,1:表示减少
			       		subContentRight:'8.63%',
			       		monthChartData:[
			       			['201607','201608','201609','201610','201611','201612','201701','201702','201703','201704','201705','201706'],
			       			['8.09','9.11','11.54','9.03','9.91','9.12','13.76','4.72','8.50','7.94','8.17','8.50'],
			       			['7.62','9.76','10.23','8.68','9.86','9.39','13.47','6.34','8.40','7.92','8.60','8.50'],
			       			['-5.81','7.11','-11.37','-3.97','-0.45','2.96','-2.08','34.47','-1.24','-0.35','5.25','0.00'],
			       			[0,15,5]
			       		]
			       	},
			       	{
			       		title:'三类烟以上销量',
			       		rightUpIcon:'fa-bar-chart',
			       		content:'89.70',
			       		subContent:'万箱',
			       		subTitleLeft:'去年同期',
			       		subContentLeft:'100.52万箱',
			       		subTitleRight:'增减幅度',
			       		subContentFlag:'1',//0:表示增加,1:表示减少
			       		subContentRight:'10.75%',
			       		monthChartData:[
			       			['201607','201608','201609','201610','201611','201612','201701','201702','201703','201704','201705','201706'],
			       			['6.09','8.87','8.01','7.68','8.41','7.09','11.02','4.04','6.88','6.75','7.13','7.40'],
			       			['6.25','8.10','8.56','7.15','8.29','7.58','12.08','5.16','6.99','6.99','7.41','7.42'],
			       			['2.63','-8.67','6.87','-6.88','-1.45','6.86','9.68','27.94','1.68','3.53','4.03','0.34'],
			       			[0,15,5]
			       		]
			       	}
		       	]
			}
			
		},
		components: {
			middlebox
		},
		methods:{
			
		}
	
	}
</script>

<style lang="scss" scoped>
	@import "../../../../styles/variables.scss";
	.m-ul{
		margin-left: 0.1rem;
		margin-top: 0.1rem;
	}
	.m-li{
		float: left;
		margin-left: 0.05rem;
		margin-right: 0.05rem;
	}

</style>