<template>
	<box-base class="leftBox">
		<div slot="box-title">
			<p class="title">全国36个重点城市排名</p>
		</div>
		<div slot="box-extend">
			<tab-base :option=paneOption @tab-click="tabClick" class="tabClass"></tab-base>	
		</div>
		<div class="content">
			<barChart :chartData="chartData"></barChart>
		</div>
	</box-base>
</template>

<script>
	import boxBase from 'components/box/box-base.vue';
	import tabBase from 'components/tab/tab-base.vue';
	import barChart from './barChart.vue';
	export default {
		data() {
			return {
				chartData:{
					xData:[
						'拉萨','长春','呼和浩特','成都','郑州','银川','天津','海口','沈阳','深圳',
						'济南','广州','厦门','长沙','合肥','北京','上海','宁波','西安','重庆',
						'南京','青岛','福州','西宁','太原','兰州','武汉','哈尔滨','乌鲁木齐','昆明',
						'大连','杭州','南宁','贵阳','石家庄','南昌'
					],
					yData:[
						{max:50,min:0},
						{max:-10,min:15},
					],
					bar1Data:[
						2,2,8,28,18,6,22,8,14,22,
						1,20,8,14,12,35,35,18,'-',47,
						16,17,15,4,8,8,18,16,6,16,
						10,18,10,11,14,8
					],
					bar2Data:[
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-','-','-',18,'-',
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-'
					],
					line1Data:[
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						13, 12, 11, 9, 8, 7,
					],
					line2Data:[
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20
					],
					chartName:['销量','同比','行业平均'],
					chartUnit:['万箱','%'],
				},
				chartData0:{
					xData:[
						'拉萨','长春','呼和浩特','成都','郑州','银川','天津','海口','沈阳','深圳',
						'济南','广州','厦门','长沙','合肥','北京','上海','宁波','西安','重庆',
						'南京','青岛','福州','西宁','太原','兰州','武汉','哈尔滨','乌鲁木齐','昆明',
						'大连','杭州','南宁','贵阳','石家庄','南昌'
					],
					yData:[
						{max:50,min:0},
						{max:-10,min:15},
					],
					bar1Data:[
						2,2,8,28,18,6,22,8,14,22,
						1,20,8,14,12,35,35,18,'-',47,
						16,17,15,4,8,8,18,16,6,16,
						10,18,10,11,14,8
					],
					bar2Data:[
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-','-','-',18,'-',
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-'
					],
					line1Data:[
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						13, 12, 11, 9, 8, 7,
					],
					line2Data:[
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20
					],
					chartName:['销量','同比','行业平均'],
					chartUnit:['万箱','%'],
				},
				chartData1:{
					xData:[
						'拉萨','长春','呼和浩特','成都','郑州','银川','天津','海口','沈阳','深圳',
						'济南','广州','厦门','长沙','合肥','北京','上海','宁波','西安','重庆',
						'南京','青岛','福州','西宁','太原','兰州','武汉','哈尔滨','乌鲁木齐','昆明',
						'大连','杭州','南宁','贵阳','石家庄','南昌'
					],
					yData:[
						{max:50,min:0},
						{max:-10,min:15},
					],
					bar1Data:[
						3,3,12,38,38,16,12,18,24,22,
						4,30,18,14,22,45,25,28,'-',37,
						26,27,25,14,18,18,38,26,16,6,
						20,28,30,31,24,18
					],
					bar2Data:[
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-','-','-',38,'-',
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-'
					],
					line1Data:[
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						5.5, 6, 8, 9, 8, 7, 6, 5,5,4.5,
						11, 10, 11, 9, 8, 7, 6, 5,5,4.5,
						14, 9, 11, 8.5, 8, 7,
					],
					line2Data:[
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20
					],
					chartName:['销量','同比','行业平均'],
					chartUnit:['万','%'],
				},
				chartData2:{
					xData:[
						'拉萨','长春','呼和浩特','成都','郑州','银川','天津','海口','沈阳','深圳',
						'济南','广州','厦门','长沙','合肥','北京','上海','宁波','西安','重庆',
						'南京','青岛','福州','西宁','太原','兰州','武汉','哈尔滨','乌鲁木齐','昆明',
						'大连','杭州','南宁','贵阳','石家庄','南昌'
					],
					yData:[
						{max:50,min:0},
						{max:-10,min:15},
					],
					bar1Data:[
						7,5,8,18,18,16,22,18,14,22,
						1,20,8,14,12,35,35,38,'-',27,
						16,17,15,4,18,28,18,36,6,26,
						30,28,20,21,14,8
					],
					bar2Data:[
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-','-','-',28,'-',
						'-','-','-','-','-','-','-','-','-','-',
						'-','-','-','-','-','-'
					],
					line1Data:[
						13, 12, 11, 9, 8, 7, 6, 5,5,4.5,
						9, 6, 10, 9, 8, 7, 6, 5,5,4.5,
						12, 10.5, 11, 9, 8, 7, 6, 5,5,4.5,
						14, 12, 10, 9, 8, 7,
					],
					line2Data:[
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20,20,20,20,20,
						20,20,20,20,20,20
					],
					chartName:['销量','同比','行业平均'],
					chartUnit:['元','%'],
				},
				paneOption: {
					data:[
						{
							key: 'chartData0',
							text: '卷烟销量'
						},
						{
							key: 'chartData1',
							text: '销售收入'
						},
						{
							key: 'chartData2',
							text: '单箱均价'
						},
					],
					activePane:'chartData0'
				},
			}
		},
		components: {
			boxBase,
			tabBase,
			barChart
		},
		methods: {
			tabClick:function(curTab){
				this.chartData = this[curTab];
			}
		},
		mounted() {
			
		}
	}
</script>

<style lang="scss" scoped>
	@import "../../../../styles/variables.scss";
	.leftBox {
		height:3.2rem;
		margin-top:$box-distince;
		.extend-class{
			
		}
		.tabClass{
			
		}
		.red {
			color: $red;
		}
		
		.green {
			color: $green;
		}
		
		.orange {
			color: $orange;
		}
	}
</style>